In [2]:
#Importing library
import pandas as pd

In [3]:
#Reading csv file
data = pd.read_csv("C:/Users/Bhavik/Desktop/Data Science/1. Linear Regression/3_Insurance_Losses/InsuranceLosses.csv")

In [5]:
#View the data
data.head()

,Policy Number,Age,Years of Driving Experience,Number of Vehicles,Gender,Married,Vehicle Age,Fuel Type,Losses
0,150024,24,5,1,M,Married,11,P,203.319595
1,144880,31,10,1,F,Single,6,P,402.197302
2,133742,56,37,1,M,Married,0,D,553.132096
3,151282,52,31,1,F,Married,15,P,292.430579
4,174407,20,3,1,M,Single,15,P,246.540576

In [6]:
#View the dimension of the data
data.shape

(15290, 9)

In [7]:
#View the column names in the data
data.columns

Index(['Policy Number', 'Age', 'Years of Driving Experience',
       'Number of Vehicles', 'Gender', 'Married', 'Vehicle Age', 'Fuel Type',
       'Losses'],
      dtype='object')

In [9]:
#View the single column of the data
data["Age"]

0        24
1        31
2        56
3        52
4        20
         ..
15285    61
15286    69
15287    69
15288    22
15289    20
Name: Age, Length: 15290, dtype: int64

In [11]:
data[["Age","Years of Driving Experience"]]

       Age  Years of Driving Experience
0       24                            5
1       31                           10
2       56                           37
3       52                           31
4       20                            3
...    ...                          ...
15285   61                           43
15286   69                           48
15287   69                           51
15288   22                            4
15289   20                            2

[15290 rows x 2 columns]